Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/asylum_seekers_and_refugees/refugee_status_and_leave_to_remain/family_reunification_for_refugees_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Family reunification for people granted refugee status or subsidiary protection
ga: Athaontú daoine le stádas dídeanaí nó cosaint choimhdí

source: A person who has international protection (refugee status or subsidiary protection) in Ireland can apply to the Minister for Justice and Equality for permission to have a member of their family enter and live in the State
ga: Is féidir le duine a bhfuil stádas dídeanaí nó cosanta coimhdí acu iarratas a dhéanamh chun an Aire Dlí.agus Cirt agus Comhionannais do chead chun glacadh le teacht isteach agus le cónaí baill dá dteaghlach sa Stát

source: Since 31 December 2016, the International Protection Act 2015 sets out their right to apply for family reunification
ga: Is in Alt 18 d’Acht na nDídeanaithe 1996 a leagtar amach ceart an dídeanaí chun iarratas a dhéanamh ar athaontú a dteaghlaigh

source: Under sections 56 and 57 of the Act, you may apply to the Minister if you have a current declaration as a convention refugee or a programme refugee or if you have a current subsidiary protection declaration
ga: Is amhlaidh faoi alt 25 de Rialacháin an Aontais Eorpaigh ( Cosaint Choimhdeach) 2013, a bhíonn an ceart freisin ag an duine dá dtugtar cosaint choimhdeach (ar a dtugtar “an t-iarrthóir”) chun iarratas a dhéanamh ar athaontú teaghlaigh

source: People with permission to remain do not have a right to family reunification
ga: Ní bhíonn ceart ag daoine le cead chun fanacht ar athaontú teaghlaigh

source: However, they may apply to have a member of their family join them in Ireland
ga: Is féidir leo iarratas a dhéanamh ámh chun is go dtiocfadh ball dá dteaghlach chun fanacht leo in Éirinn

source: There is no legal definition as to who is a member of the family for people with permission to remain
ga: Níl aon sainmhíniú dlíthiúil ann faoin duine ar dá dteaghlach iad i ndáil leis na daoine le cead chun fanacht

source: However, it is likely that such a definition would be similar to that of a person with refugee status or subsidiary protection
ga: Is dócha ámh go mbeadh an sainmhíniú úd cosúil le ceann duine le stádas dídeanaí nó cosanta coimhdí

source: A member of the family in relation to a person who has refugee status or subsidiary protection (known as “the sponsor”) means:
ga: Ciallaíonn ball teaghlaigh i ndáil le duine éigin le stádas dídeanaí nó cosanta coimhdí:

source: • Spouse or civil partner – provided that the marriage or civil partnership is in existence when the application for international protection is made
ga: • Sa chás go mbíonn dídeanaí nó iarrthóir pósta nó i bpáirtnéireacht shibhialta, a gcéile nó a bpáirtí sibhialta, ar an gcuntar gurb ann don phósadh nó don pháirtnéireacht shibhialta nuair a dhéantar an t-iarratas ar athaontú teaghlaigh;

source: • Parent(s) – if the sponsor is aged under 18 and is not married on the date the application for family reunification is made
ga: • Sa chás go bhfuil dídeanaí nó iarrthóir faoi bhun 18 bliain d’aois agus iad gan bheith pósta, a dtuismitheoirí;

source: • Child who is aged under 18 and not married on the date the application for family reunification is made
ga: • Leanbh le dídeanaí nó le hiarrthóir atá faoi bhun 18 bliain d’aois agus iad gan bheith pósta lá an iarratais ar athaontú teaghlaigh

source: You must apply within 12 months of being granted a refugee or a subsidiary protection declaration or from the date of your arrival in Ireland as a programme refugee
ga: Atreoraítear an t-iarratas ar athaontú teaghlaigh chuig An Coimisinéir um Iarratais ó Dhídeanaithe agus tugtar fógra d’Ard-Choimisinéir na Náisiún Aontaithe le haghaidh Dídeanaithe

source: You apply for permission for your family member (s) either:
ga: Is é an Coimisinéir um Iarratais ó Dhídeanaithe a imscrúdóidh an t-iarratas agus a thaiscfidh tuairisc i scríbhinn chuig an Aire Dlí agus Cirt agus Comhionannais

source: A sponsor in Ireland who wishes to make an application to have a family member join them must apply in writing to the Family Reunification Section of the Irish Naturalisation and Immigration Service (INIS) - see 'Where to apply' below
ga: Más mian le hurraitheoir iarratas a dhéanamh le go n-aontódh ball teaghlaigh leo, ní foláir d'iarratas scríofa chuig an Rannóg Athaontaithe Teaghlaigh don tSeirbhís Eadóirseachta agus Inimirce na hÉireann (SEIÉ) - féach 'Cá háit a ndéanfaidh mé iarratas' thíos

source: Details of the documents required and the application process are in frequently asked questions on family reunification on the INIS website
ga: Tá tuilleadh faoi na cáipéisí riachtanacha i gceisteanna coitianta um athaontú teaghlaigh ar shuíomh gréasáin SEIÉ

source: The sponsor will receive a letter from INIS informing them whether the application was successful
ga: Gheobhaidh an t-urraitheoir litir ó SEIÉ a chuireann fios d'urratheoir go n-éireoidh nó nach n-éireoidh leis an iarratas

source: If the request for family reunification has been granted, the family member living abroad should then apply online for a visa to join the family member in Ireland
ga: Má thugtar an t-iarratas ar athaontú teaghlaigh, caithfidh an ball teaghlaigh atá ina chónaí thar lear iarratas ar víosa ar líne a dhéanamh

source: There is information about family reunification for refugees on the INIS website
ga: Tá faisnéis faoin athaontú teaghlaigh ar shuíomh gréasáin SEIÉ

source: The person who enters and resides in the State as a result of family reunification is entitled to remain in the State and to the same rights and privileges as a person who has international protection for as long as the refugee or sponsor who made the application is entitled to remain in the State
ga: Bíonn an duine a iontrálann agus a chónaíonn sa stát mar thoradh ar athaontú teaghlaigh i dteidil chun fanacht sa Stát agus i dteidil do na cearta agus pribhléidí céanna le duine le cosaint idirnáisiúnta ar feadh chomh fada agus a bhíonn an t-urraitheoir a rinne an t-iarratas i dteidil chun fanacht sa Stát
